            .INCLUDE <M328PDEF.INC>

            .EQU SP=RAMEND-4*3              ; СМЕЩАЕМ УКАЗАТЕЛЬ СТЕКА НА 12 БАЙТ ВВЕРХ.

            .DSEG
            .ORG SP+1                       ; РЕЗЕРВИРУЕМ ПОД СТЕКОМ 12 БАЙТ ДЛЯ ТРЕХ ПЕРЕМЕННЫХ ТИПА FLOAT32.
A:          .BYTE 4                         ; ДЕЛИМОЕ.
B:          .BYTE 4                         ; ДЕЛИТЕЛЬ.
C:          .BYTE 4                         ; ЧАСТНОЕ.

            .CSEG
            .ORG 0x00
            RJMP RESET
            
            .INCLUDE "FLOAT32.ASM"

RESET:      LDI YL,LOW(SP)
            LDI YH,HIGH(SP)
            OUT SPL,YL
            OUT SPH,YH

            LDI ZL,LOW(FLOATERR)            ; ЗАПИСЫВАЕМ В Z АДРЕС ОБРАБОТЧИКА ОШИБОК
            LDI ZH,HIGH(FLOATERR)           ; ДЛЯ БИБЛИОТЕКИ FLOAT32.
            
MAIN:       

;===========================================================================================
; BEGIN: ПРИМЕРЫ НА ДЕЛЕНИЕ.
;===========================================================================================
            ;
            ; СЛУЧАЙ 1.         
;            LDI R16,0x00                    ; A=1.0F.
;            LDI R17,0x00
;            LDI R18,0x80
;            LDI R19,0x3F

;            LDI R20,0xFF                    ; B=1.99999988079071044921875F.
;            LDI R21,0xFF
;            LDI R22,0xFF
;            LDI R23,0x3F

            ;
            ; СЛУЧАЙ 2.         
;            LDI R16,0x20                    ; A=1.688541412353515625F.
;            LDI R17,0x22
;            LDI R18,0xD8
;            LDI R19,0x3F

;            LDI R20,0x00                    ; B=1.00885009765625F.
;            LDI R21,0x22
;            LDI R22,0x81
;            LDI R23,0x3F

            ;
            ; СЛУЧАЙ 3.         
;            LDI R16,0x00                    ; A=1.3125F.
;            LDI R17,0x00
;            LDI R18,0xA8
;            LDI R19,0x3F

;            LDI R20,0x00                    ; B=1.75F.
;            LDI R21,0x00
;            LDI R22,0xE0
;            LDI R23,0x3F

            ;
            ; СЛУЧАЙ 4.         
;            LDI R16,0x00                    ; A=1.6875F.
;            LDI R17,0x00
;            LDI R18,0xD8
;            LDI R19,0x3F

;            LDI R20,0x00                    ; B=1.5F.
;            LDI R21,0x00
;            LDI R22,0xC0
;            LDI R23,0x3F

            ;
            ; СЛУЧАЙ 5.         
;            LDI R16,0xFF                    ; A=1.99999988079071044921875F.
;            LDI R17,0xFF
;            LDI R18,0xFF
;            LDI R19,0x3F

;            LDI R20,0xFF                    ; B=A.
;            LDI R21,0xFF
;            LDI R22,0xFF
;            LDI R23,0x3F

            ;
            ; СЛУЧАЙ 6.         
;            LDI R16,0xFF                    ; A=1.99999988079071044921875F.
;            LDI R17,0xFF
;            LDI R18,0xFF
;            LDI R19,0x3F

;            LDI R20,0x00                    ; B=1.0F.
;            LDI R21,0x00
;            LDI R22,0x80
;            LDI R23,0x3F

            ;
            ; СЛУЧАЙ 7.
;            LDI R16,0x20                    ; A=1.688541412353515625F * 2^97.
;            LDI R17,0x22
;            LDI R18,0x58
;            LDI R19,0x70

;            LDI R20,0x00                    ; B=1.00885009765625F * 2^-95.
;            LDI R21,0x22
;            LDI R22,0x01
;            LDI R23,0x10

            ;
            ; СЛУЧАЙ 8.
;            LDI R16,0x20                    ; A=1.688541412353515625F * 2^-116.
;            LDI R17,0x22
;            LDI R18,0xD8
;            LDI R19,0x05

;            LDI R20,0x00                    ; B=1.00885009765625F * 2^20.
;            LDI R21,0x22
;            LDI R22,0x81
;            LDI R23,0x49

            ;
            ; СЛУЧАЙ 9.
;            LDI R16,0x00                    ; A=1.0F * 2^-96.
;            LDI R17,0x00
;            LDI R18,0x80
;            LDI R19,0x0F

;            LDI R20,0xFF                    ; B=F * 2^30.
;            LDI R21,0xFF
;            LDI R22,0xFF
;            LDI R23,0x4E

            ;
            ; СЛУЧАЙ 10.
;            LDI R16,0x00                    ; A=1.0F * 2^20.
;            LDI R17,0x00
;            LDI R18,0x80
;            LDI R19,0x49

;            LDI R20,0xFF                    ; B=1.99999988079071044921875F * 2^-108.
;            LDI R21,0xFF
;            LDI R22,0xFF
;            LDI R23,0x09

            ;
            ; СЛУЧАЙ 11.
;            LDI R16,0x20                    ; A=1.688541412353515625F * 2^3.
;            LDI R17,0x22
;            LDI R18,0x58
;            LDI R19,0x41

;            LDI R20,0x00                    ; B=1.00885009765625F * 2^106.
;            LDI R21,0x22
;            LDI R22,0x81
;            LDI R23,0x74

            ;
            ; СЛУЧАЙ 12.
;            LDI R16,0x00                    ; A=1.0F * 2^3.
;            LDI R17,0x00
;            LDI R18,0x00
;            LDI R19,0x41

;            LDI R20,0xFF                    ; B=1.99999988079071044921875F * 2^106
;            LDI R21,0xFF
;            LDI R22,0xFF
;            LDI R23,0x74

            ;
            ; СЛУЧАЙ 13.
;            LDI R16,0x00                    ; A=1.0F * 2^20.
;            LDI R17,0x00
;            LDI R18,0x80
;            LDI R19,0x49

;            LDI R20,0xFF                    ; B=1.99999988079071044921875F * 2^109.
;            LDI R21,0xFF
;            LDI R22,0x7F
;            LDI R23,0x09

            ;
            ; СЛУЧАЙ 14.
;            LDI R16,0x00                    ; A=1.0F * 2^-115.
;            LDI R17,0x00
;            LDI R18,0x00
;            LDI R19,0x06

;            LDI R20,0xFF                    ; B=1.99999988079071044921875F * 2^12.
;            LDI R21,0xFF
;            LDI R22,0xFF
;            LDI R23,0x45

            ;
            ; СЛУЧАЙ 15.
;            LDI R16,0xFF                    ; A=1.99999988079071044921875F * 2^-100.
;            LDI R17,0xFF
;            LDI R18,0xFF
;            LDI R19,0x0D

;            LDI R20,0x00                    ; B=1.0F * 2^27.
;            LDI R21,0x00
;            LDI R22,0x00
;            LDI R23,0x4D

            ;
            ; ОБА ОПЕРАНДА ОТРИЦАТЕЛЬНЫЕ.
            ; РЕЗУЛЬТАТ ПОЛОЖИТЕЛЬНЫЙ.
;            LDI R16,0x00                    ; A=-1.0F * 2^20.
;            LDI R17,0x00
;            LDI R18,0x80
;            LDI R19,0xC9

;            LDI R20,0xFF                    ; B=-1.99999988079071044921875F * 2^-108.
;            LDI R21,0xFF
;            LDI R22,0xFF
;            LDI R23,0x89

            ;
            ; ПЕРВЫЙ ОПЕРАНД ОТРИЦАТЕЛЬНЫЙ.
            ; ВТОРОЙ ОПЕРАНД ПОЛОЖИТЕЛЬНЫЙ.
            ; РЕЗУЛЬТАТ ОТРИЦАТЕЛЬНЫЙ.
;            LDI R16,0x00                    ; A=-1.0F * 2^20.
;            LDI R17,0x00
;            LDI R18,0x80
;            LDI R19,0xC9

;            LDI R20,0xFF                    ; B=1.99999988079071044921875F * 2^-108.
;            LDI R21,0xFF
;            LDI R22,0xFF
;            LDI R23,0x09

            ;
            ; ПЕРВЫЙ ОПЕРАНД ПОЛОЖИТЕЛЬНЫЙ.
            ; ВТОРОЙ ОПЕРАНД ОТРИЦАТЕЛЬНЫЙ.
            ; РЕЗУЛЬТАТ ОТРИЦАТЕЛЬНЫЙ.
;            LDI R16,0x00                    ; A=1.0F * 2^20.
;            LDI R17,0x00
;            LDI R18,0x80
;            LDI R19,0x49

;            LDI R20,0xFF                    ; B=-1.99999988079071044921875F * 2^-108.
;            LDI R21,0xFF
;            LDI R22,0xFF
;            LDI R23,0x89

            ;
            ; ДЕЛИМОЕ РАВНО НУЛЮ.
            ; РЕЗУЛЬТАТ НУЛЕВОЙ.
;            LDI R16,0x00                    ; A=0.0F.
;            LDI R17,0x00
;            LDI R18,0x00
;            LDI R19,0x00

;            LDI R20,0xFF                    ; B=-1.99999988079071044921875F * 2^-108.
;            LDI R21,0xFF
;            LDI R22,0xFF
;            LDI R23,0x89

            ;
            ; ДЕЛИТЕЛЬ РАВЕН НУЛЮ.
            ; ОШИБКА.
;            LDI R16,0x00                    ; A=1.0F * 2^20.
;            LDI R17,0x00
;            LDI R18,0x80
;            LDI R19,0x49

;            LDI R20,0x00                    ; B=0.0F.
;            LDI R21,0x00
;            LDI R22,0x00
;            LDI R23,0x00            
;===========================================================================================
; END: ПРИМЕРЫ НА ДЕЛЕНИЕ.
;===========================================================================================

;===========================================================================================
; BEGIN: ПРИМЕРЫ НА УМНОЖЕНИЕ.
;===========================================================================================
            ;
            ; СЛУЧАЙ 1.
;            LDI R16,0x00                    ; A=1.875F.
;            LDI R17,0x00
;            LDI R18,0xF0
;            LDI R19,0x3F

;            LDI R20,0x00                    ; B=1.5F.
;            LDI R21,0x00
;            LDI R22,0xC0
;            LDI R23,0x3F

            ;
            ; СЛУЧАЙ 2.
;            LDI R16,0x00                    ; A=1.25F.
;            LDI R17,0x00
;            LDI R18,0xA0
;            LDI R19,0x3F

;            LDI R20,0xCE                    ; B=1.6000001430511474609375F.
;            LDI R21,0xCC
;            LDI R22,0xCC
;            LDI R23,0x3F

            ;
            ; СЛУЧАЙ 3.
;            LDI R16,0x00                    ; A=1.5F.
;            LDI R17,0x00
;            LDI R18,0xC0
;            LDI R19,0x3F

;            LDI R20,0xAB                    ; B=1.33333337306976318359375F.
;            LDI R21,0xAA
;            LDI R22,0xAA
;            LDI R23,0x3F

            ;
            ; СЛУЧАЙ 4.
;            LDI R16,0xFA                    ; A=1.9999992847442626953125F.
;            LDI R17,0xFF
;            LDI R18,0xFF
;            LDI R19,0x3F

;            LDI R20,0x00                    ; B=1.5F.
;            LDI R21,0x00
;            LDI R22,0xC0
;            LDI R23,0x3F

            ;
            ; СЛУЧАЙ 5.
;            LDI R16,0xFE                    ; A=1.9999997615814208984375F.
;            LDI R17,0xFF
;            LDI R18,0xFF
;            LDI R19,0x3F

;            LDI R20,0x00                    ; B=1.5F.
;            LDI R21,0x00
;            LDI R22,0xC0
;            LDI R23,0x3F

            ;
            ; СЛУЧАЙ 6.
;            LDI R16,0xFE                    ; A=1.9999997615814208984375F.
;            LDI R17,0xFF
;            LDI R18,0xFF
;            LDI R19,0x3F

;            LDI R20,0x01                    ; B=1.00000011920928955078125F.
;            LDI R21,0x00
;            LDI R22,0x80
;            LDI R23,0x3F

            ;
            ; СЛУЧАЙ 7.
;            LDI R16,0xFE                    ; A=1.9999997615814208984375F * 2^100.
;            LDI R17,0xFF
;            LDI R18,0xFF
;            LDI R19,0x71

;            LDI R20,0x00                    ; B=1.5F * 2^27.
;            LDI R21,0x00
;            LDI R22,0x40
;            LDI R23,0x4D

            ;
            ; СЛУЧАЙ 8.
;            LDI R16,0xFE                    ; A=1.9999997615814208984375F * 2^100.
;            LDI R17,0xFF
;            LDI R18,0xFF
;            LDI R19,0x71

;            LDI R20,0x00                    ; B=1.5F * 2^26.
;            LDI R21,0x00
;            LDI R22,0xC0
;            LDI R23,0x4C

            ;
            ; СЛУЧАЙ 9.
;            LDI R16,0xFE                    ; A=1.9999997615814208984375F * 2^100.
;            LDI R17,0xFF
;            LDI R18,0xFF
;            LDI R19,0x71

;            LDI R20,0x00                    ; B=1.5F * 2^28.
;            LDI R21,0x00
;            LDI R22,0xC0
;            LDI R23,0x4D

            ;
            ; СЛУЧАЙ 10.
;            LDI R16,0xFE                    ; A=1.9999997615814208984375F * 2^-100.
;            LDI R17,0xFF
;            LDI R18,0xFF
;            LDI R19,0x0D

;            LDI R20,0x00                    ; B=1.5F * 2^-27.
;            LDI R21,0x00
;            LDI R22,0x40
;            LDI R23,0x32

            ;
            ; СЛУЧАЙ 11.
;            LDI R16,0xFE                    ; A=1.9999997615814208984375F * 2^-100.
;            LDI R17,0xFF
;            LDI R18,0xFF
;            LDI R19,0x0D

;            LDI R20,0x00                    ; B=1.5F * 2^-28.
;            LDI R21,0x00
;            LDI R22,0xC0
;            LDI R23,0x31

            ;
            ; СЛУЧАЙ 12.
;            LDI R16,0x00                    ; A=1.25F * 2^100.
;            LDI R17,0x00
;            LDI R18,0xA0
;            LDI R19,0x71

;            LDI R20,0xAB                    ; B=1.33333337306976318359375F * 2^27.
;            LDI R21,0xAA
;            LDI R22,0x2A
;            LDI R23,0x4D

            ;
            ; СЛУЧАЙ 13.
;            LDI R16,0xFE                    ; A=1.9999997615814208984375F * 2^100.
;            LDI R17,0xFF
;            LDI R18,0xFF
;            LDI R19,0x71

;            LDI R20,0x01                    ; B=1.00000011920928955078125F * 2^28.
;            LDI R21,0x00
;            LDI R22,0x80
;            LDI R23,0x4D

            ;
            ; СЛУЧАЙ 14.
;            LDI R16,0x00                    ; A=1.25F * 2^-126.
;            LDI R17,0x00
;            LDI R18,0xA0
;            LDI R19,0x00

;            LDI R20,0xAB                    ; B=1.33333337306976318359375F * 2^-25.
;            LDI R21,0xAA
;            LDI R22,0x2A
;            LDI R23,0x33            

            ;
            ; СЛУЧАЙ 15.
;            LDI R16,0xFE                    ; A=1.9999997615814208984375F * 2^100.
;            LDI R17,0xFF
;            LDI R18,0xFF
;            LDI R19,0x71

;            LDI R20,0x01                    ; B=1.00000011920928955078125F * 2^27.
;            LDI R21,0x00
;            LDI R22,0x00
;            LDI R23,0x4D

            ;
            ; СЛУЧАЙ 16.
;            LDI R16,0xFE                    ; A=1.9999997615814208984375F * 2^100.
;            LDI R17,0xFF
;            LDI R18,0xFF
;            LDI R19,0x71

;            LDI R20,0x01                    ; B=1.00000011920928955078125F * 2^26.
;            LDI R21,0x00
;            LDI R22,0x80
;            LDI R23,0x4C

            ;
            ; СЛУЧАЙ 17.
;            LDI R16,0xFE                    ; A=1.9999997615814208984375F * 2^-100.
;            LDI R17,0xFF
;            LDI R18,0xFF
;            LDI R19,0x0D

;            LDI R20,0x01                    ; B=1.00000011920928955078125F * 2^-27.
;            LDI R21,0x00
;            LDI R22,0x00
;            LDI R23,0x32

            ;
            ; СЛУЧАЙ 18.
;            LDI R16,0xFE                    ; A=1.9999997615814208984375F * 2^-100.
;            LDI R17,0xFF
;            LDI R18,0xFF
;            LDI R19,0x0D

;            LDI R20,0x01                    ; B=1.00000011920928955078125F * 2^-30.
;            LDI R21,0x00
;            LDI R22,0x80
;            LDI R23,0x30

            ;
            ; СЛУЧАЙ 19.
;            LDI R16,0xFF                    ; A=1.99999988079071044921875fF * 2^-126.
;            LDI R17,0xFF
;            LDI R18,0xFF
;            LDI R19,0x00

;            LDI R20,0x00                    ; B=1.0F * 2^-1.
;            LDI R21,0x00
;            LDI R22,0x00
;            LDI R23,0x3F

            ;
            ; ПЕРВЫЙ ОПЕРАНД НУЛЕВОЙ
            ; РЕЗУЛЬТАТ НУЛЕВОЙ.
;            LDI R16,0x00                    ; A=0.0F.
;            LDI R17,0x00
;            LDI R18,0x00
;            LDI R19,0x00

;            LDI R20,0x01                    ; B=1.00000011920928955078125F * 2^26.
;            LDI R21,0x00
;            LDI R22,0x80
;            LDI R23,0x4C

            ;
            ; ВТОРОЙ ОПЕРАНД НУЛЕВОЙ
            ; РЕЗУЛЬТАТ НУЛЕВОЙ.
;            LDI R16,0xFE                    ; A=1.9999997615814208984375F * 2^100.
;            LDI R17,0xFF
;            LDI R18,0xFF
;            LDI R19,0x71

;            LDI R20,0x00                    ; B=0.0F.
;            LDI R21,0x00
;            LDI R22,0x00
;            LDI R23,0x00

            ;
            ; ОБА ОПЕРАНДА ОТРИЦАТЕЛЬНЫЕ.
            ; РЕЗУЛЬТАТ ПОЛОЖИТЕЛЬНЫЙ.
;            LDI R16,0xFE                    ; A=-1.9999997615814208984375F * 2^100.
;            LDI R17,0xFF
;            LDI R18,0xFF
;            LDI R19,0xF1

;            LDI R20,0x01                    ; B=-1.00000011920928955078125F * 2^26.
;            LDI R21,0x00
;            LDI R22,0x80
;            LDI R23,0xCC

            ;
            ; ПЕРВЫЙ ОПЕРАНД ОТРИЦАТЕЛЬНЫЙ.
            ; ВТОРОЙ ОПЕРАНД ПОЛОЖИТЕЛЬНЫЙ.
            ; РЕЗУЛЬТАТ ОТРИЦАТЕЛЬНЫЙ.
;            LDI R16,0xFE                    ; A=-1.9999997615814208984375F * 2^100.
;            LDI R17,0xFF
;            LDI R18,0xFF
;            LDI R19,0xF1

;            LDI R20,0x01                    ; B=1.00000011920928955078125F * 2^26.
;            LDI R21,0x00
;            LDI R22,0x80
;            LDI R23,0x4C

            ;
            ; ПЕРВЫЙ ОПЕРАНД ПОЛОЖИТЕЛЬНЫЙ.
            ; ВТОРОЙ ОПЕРАНД ОТРИЦАТЕЛЬНЫЙ.
            ; РЕЗУЛЬТАТ ОТРИЦАТЕЛЬНЫЙ.
;            LDI R16,0xFE                    ; A=1.9999997615814208984375F * 2^100.
;            LDI R17,0xFF
;            LDI R18,0xFF
;            LDI R19,0x71

;            LDI R20,0x01                    ; B=-1.00000011920928955078125F * 2^26.
;            LDI R21,0x00
;            LDI R22,0x80
;            LDI R23,0xCC
;===========================================================================================
; END: ПРИМЕРЫ НА УМНОЖЕНИЕ.
;===========================================================================================

;===========================================================================================
; BEGIN: ПРИМЕРЫ НА СЛОЖЕНИЕ.
;===========================================================================================
            ;
            ; СЛУЧАЙ 1.
;            LDI R16,0xFF                    ; A=1.99999988079071044921875F * 2^127.
;            LDI R17,0xFF
;            LDI R18,0x7F
;            LDI R19,0x7F

;            LDI R20,0xFF                    ; B=A.
;            LDI R21,0xFF
;            LDI R22,0x7F
;            LDI R23,0x7F

            ;
            ; СЛУЧАЙ 2.
;            LDI R16,0xFF                    ; A=1.99999988079071044921875F * 2^-126.
;            LDI R17,0xFF
;            LDI R18,0xFF
;            LDI R19,0x00

;            LDI R20,0xFF                    ; B=A.
;            LDI R21,0xFF
;            LDI R22,0xFF
;            LDI R23,0x00

            ;
            ; СЛУЧАЙ 3.
;            LDI R16,0x00                    ; A=1.0F * 2^127.
;            LDI R17,0x00
;            LDI R18,0x00
;            LDI R19,0x7F

;            LDI R20,0x03                    ; B=1.00000035762786865234375F * 2^127.
;            LDI R21,0x00
;            LDI R22,0x00
;            LDI R23,0x7F

            ;
            ; СЛУЧАЙ 4.
;            LDI R16,0x00                    ; A=1.0F * 2^-126.
;            LDI R17,0x00
;            LDI R18,0x80
;            LDI R19,0x00

;            LDI R20,0x03                    ; B=1.00000035762786865234375F * 2^-126.
;            LDI R21,0x00
;            LDI R22,0x80
;            LDI R23,0x00

            ;
            ; СЛУЧАЙ 5.
;            LDI R16,0x00                    ; A=1.0F * 2^127.
;            LDI R17,0x00
;            LDI R18,0x00
;            LDI R19,0x7F

;            LDI R20,0x01                    ; B=1.00000011920928955078125F * 2^127.
;            LDI R21,0x00
;            LDI R22,0x00
;            LDI R23,0x7F

            ;
            ; СЛУЧАЙ 6.
;            LDI R16,0x00                    ; A=1.0F * 2^-126.
;            LDI R17,0x00
;            LDI R18,0x80
;            LDI R19,0x00

;            LDI R20,0x01                    ; B=1.00000011920928955078125F * 2^-126.
;            LDI R21,0x00
;            LDI R22,0x80
;            LDI R23,0x00

            ;
            ; СЛУЧАЙ 7.
;            LDI R16,0x00                    ; A=1.0F * 2^127.
;            LDI R17,0x00
;            LDI R18,0x00
;            LDI R19,0x7F

;            LDI R20,0xFE                    ; B=1.9999997615814208984375F * 2^127.
;            LDI R21,0xFF
;            LDI R22,0x7F
;            LDI R23,0x7F

            ;
            ; СЛУЧАЙ 8.
;            LDI R16,0x00                    ; A=1.0F * 2^-126.
;            LDI R17,0x00
;            LDI R18,0x80
;            LDI R19,0x00

;            LDI R20,0xFE                    ; B=1.9999997615814208984375F * 2^-126.
;            LDI R21,0xFF
;            LDI R22,0xFF
;            LDI R23,0x00

            ;
            ; СЛУЧАЙ 9.
;            LDI R16,0xFF                    ; A=1.99999988079071044921875F * 2^127.
;            LDI R17,0xFF
;            LDI R18,0x7F
;            LDI R19,0x7F

;            LDI R20,0xE9                    ; B=1.99993622303009033203125F * 2^118.
;            LDI R21,0xFD
;            LDI R22,0xFF
;            LDI R23,0x7A

            ;
            ; СЛУЧАЙ 10.
;            LDI R16,0xFF                    ; A=1.99999988079071044921875F * 2^-117.
;            LDI R17,0xFF
;            LDI R18,0x7F
;            LDI R19,0x05

;            LDI R20,0xE9                    ; B=1.99993622303009033203125F * 2^-126.
;            LDI R21,0xFD
;            LDI R22,0xFF
;            LDI R23,0x00

            ;
            ; СЛУЧАЙ 11.
;            LDI R16,0xFF                    ; A=1.99999988079071044921875F * 2^127.
;            LDI R17,0xFF
;            LDI R18,0x7F
;            LDI R19,0x7F

;            LDI R20,0xE9                    ; B=1.99999725818634033203125F * 2^118.
;            LDI R21,0xFF
;            LDI R22,0xFF
;            LDI R23,0x7A

            ;
            ; СЛУЧАЙ 12.
;            LDI R16,0xFF                    ; A=1.99999988079071044921875F * 2^-117.
;            LDI R17,0xFF
;            LDI R18,0x7F
;            LDI R19,0x05

;            LDI R20,0xED                    ; B=1.99999773502349853515625F * 2^-126.
;            LDI R21,0xFF
;            LDI R22,0xFF
;            LDI R23,0x00

            ;
            ; СЛУЧАЙ 14.
;            LDI R16,0x00                    ; A=1.99609375F * 2^126.
;            LDI R17,0x80
;            LDI R18,0xFF
;            LDI R19,0x7E

;            LDI R20,0xE9                    ; B=1.99999725818634033203125F * 2^117.
;            LDI R21,0xFF
;            LDI R22,0x7F
;            LDI R23,0x7A

            ;
            ; СЛУЧАЙ 15.
;            LDI R16,0x00                    ; A=1.99609375F * 2^127.
;            LDI R17,0x80
;            LDI R18,0x7F
;            LDI R19,0x7F

;            LDI R20,0xE9                    ; B=1.99993622303009033203125F * 2^118.
;            LDI R21,0xFD
;            LDI R22,0xFF
;            LDI R23,0x7A

            ;
            ; СЛУЧАЙ 16.
;            LDI R16,0x00                    ; A=1.99609375F * 2^127.
;            LDI R17,0x80
;            LDI R18,0x7F
;            LDI R19,0x7F

;            LDI R20,0xEB                    ; B=1.99996697902679443359375F * 2^118.
;            LDI R21,0xFE
;            LDI R22,0xFF
;            LDI R23,0x7A

            ;
            ; СЛУЧАЙ 26.
;            LDI R16,0x00                    ; A=1.99609375F * 2^100.
;            LDI R17,0x80
;            LDI R18,0xFF
;            LDI R19,0x71

;            LDI R20,0x00                    ; B=1.999969482421875F * 2^92.
;            LDI R21,0xFF
;            LDI R22,0xFF
;            LDI R23,0x6D

            ;
            ; СЛУЧАЙ 36.
;            LDI R16,0x00                    ; A=1.9921875F * 2^100.
;            LDI R17,0x00
;            LDI R18,0xFF
;            LDI R19,0x71

;            LDI R20,0x80                    ; B=1.9999847412109375F * 2^92.
;            LDI R21,0xFF
;            LDI R22,0xFF
;            LDI R23,0x6D

            ;
            ; СЛУЧАЙ 40.
;            LDI R16,0xFF                    ; A=1.99999988079071044921875F * 2^127.
;            LDI R17,0xFF
;            LDI R18,0x7F
;            LDI R19,0x7F

;            LDI R20,0xFF                    ; B=1.99999988079071044921875F * 2^96.
;            LDI R21,0xFF
;            LDI R22,0xFF
;            LDI R23,0x6F

            ;
            ; СЛУЧАЙ 41.
;            LDI R16,0xFF                    ; A=1.99999988079071044921875F * 2^127.
;            LDI R17,0xFF
;            LDI R18,0x7F
;            LDI R19,0x7F

;            LDI R20,0xFF                    ; B=1.99999988079071044921875F * 2^-126.
;            LDI R21,0xFF
;            LDI R22,0xFF
;            LDI R23,0x00

            ;
            ; СЛУЧАЙ 42.
;            LDI R16,0xBF                    ; A=-1.01158893108367919921875F.
;            LDI R17,0x7B
;            LDI R18,0x81
;            LDI R19,0xBF

;            LDI R20,0xFF                    ; B=-0.00006100535028963349759578704833984375F.
;            LDI R21,0xDF
;            LDI R22,0x7F
;            LDI R23,0xB8
;===========================================================================================
; END: ПРИМЕРЫ НА СЛОЖЕНИЕ.
;===========================================================================================

;===========================================================================================
; BEGIN: ПРИМЕРЫ НА ВЫЧИТАНИЕ.
;===========================================================================================
            ;
            ; СЛУЧАЙ 0.
            LDI R16,0xFF                    ; A=1.99999988079071044921875F.
            LDI R17,0xFF
            LDI R18,0xFF
            LDI R19,0x3F

            LDI R20,0xFF                    ; B=-1.99999988079071044921875F.
            LDI R21,0xFF
            LDI R22,0xFF
            LDI R23,0xBF
;===========================================================================================
; END: ПРИМЕРЫ НА ВЫЧИТАНИЕ.
;===========================================================================================

            STD Y+1,R16                     ; ЗАПИСЫВАЕМ ВХОДНЫЕ ОПЕРАНДЫ В ПАМЯТЬ.
            STD Y+2,R17                     ; В ТЕСТОВОМ КОДЕ В ЭТОМ НЕТ НЕОБХОДИМОСТИ, Т.К. ДАЛЕЕ
            STD Y+3,R18                     ; МЫ СРАЗУ ЖЕ ЧИТАЕМ ИЗ ПАМЯТИ И ПЕРЕДАЕМ ОПЕРАНДЫ В ПОДПРОГРАММУ.
            STD Y+4,R19                     ; ДЕЛАЕТСЯ ЭТО ИСКЛЮЧИТЕЛЬНО ДЛЯ ПОЛНОТЫ ПРИМЕРА ИСПОЛЬЗОВАНИЯ ПОДПРОГРАММ.

            STD Y+5,R20
            STD Y+6,R21
            STD Y+7,R22
            STD Y+8,R23

            LDD R8,Y+1                      ; ПЕРЕДАЕМ A И B В ПОДПРОГРАММУ.
            LDD R9,Y+2
            LDD R10,Y+3
            LDD R11,Y+4

            LDD R12,Y+5
            LDD R13,Y+6
            LDD R14,Y+7
            LDD R15,Y+8

            ;CALL FDIV32
            ;CALL FMUL32
            CALL FADD32

            STD Y+9,R8                      ; ЗАПИСЫВАЕМ РЕЗУЛЬТАТ В ПАМЯТЬ.
            STD Y+10,R9
            STD Y+11,R10
            STD Y+12,R11

END:        RJMP END

            ;
            ; ОБРАБОТЧИК ОШИБОК, ВОЗНИКАЮЩИХ ПРИ ВЫЧИСЛЕНИЯХ С ПЛАВАЮЩЕЙ ТОЧКОЙ:
            ; - ДЕЛЕНИЕ НА НОЛЬ.
            ; - ПЕРЕПОЛНЕНИЕ.
FLOATERR:   RJMP END
