            .INCLUDE <m328pdef.inc>

            .EQU SP=RAMEND-(3*4+255)        ; Под стеком 3 переменных по 4 байта + ASCII-строка в 255 байт.

            .DSEG
            .ORG SP+1                       ;
A:          .BYTE 4                         ; Операнд A.
B:          .BYTE 4                         ; Операнд B.
C:          .BYTE 4                         ; Результат C.
NUMSTR:     .BYTE 255                       ; Указатель на ASCII-строку с числом в SRAM.

            .CSEG
            .ORG 0x00

            RJMP RESET
            
            .INCLUDE "float32avr.asm"

RESET:      LDI YL,LOW(SP)
            LDI YH,HIGH(SP)
            OUT SPL,YL
            OUT SPH,YH

;===========================================================================================
; Begin: проверка ATOF.
;===========================================================================================
;            LDI ZL,LOW(NUMPRG << 1)         ; Отсюда, из памяти программ, будем читать числовую строку.
;            LDI ZH,HIGH(NUMPRG << 1)        ;
;            LDI XL,LOW(NUMSTR)              ; Сюда, в SRAM, будем записывать прочитанную строку.
;            LDI XH,HIGH(NUMSTR)             ;
;READNUM:    LPM R0,Z+                       ; Читаем байт из памяти программ.
;            ST X+,R0                        ; Пишем его в SRAM по указателю STR.
;            AND R0,R0                       ; Дочитали до NUL?
;            BRNE READNUM                    ; Нет, продолжаем.
;===========================================================================================
; End: проверка ATOF.
;===========================================================================================

            LDI ZL,LOW(FLOATERR)            ; Записываем в Z адрес обработчика ошибок
            LDI ZH,HIGH(FLOATERR)           ; Для библиотеки Float32AVR.
            
MAIN:       

;===========================================================================================
; Begin: примеры на деление.
;===========================================================================================
            ;
            ; Случай 1.         
;            LDI R16,0x00                    ; A=1.0f.
;            LDI R17,0x00
;            LDI R18,0x80
;            LDI R19,0x3F

;            LDI R20,0xFF                    ; B=1.99999988079071044921875f.
;            LDI R21,0xFF
;            LDI R22,0xFF
;            LDI R23,0x3F

            ;
            ; Случай 2.         
;            LDI R16,0x20                    ; A=1.688541412353515625f.
;            LDI R17,0x22
;            LDI R18,0xD8
;            LDI R19,0x3F

;            LDI R20,0x00                    ; B=1.00885009765625f.
;            LDI R21,0x22
;            LDI R22,0x81
;            LDI R23,0x3F

            ;
            ; Случай 3.         
;            LDI R16,0x00                    ; A=1.3125f.
;            LDI R17,0x00
;            LDI R18,0xA8
;            LDI R19,0x3F

;            LDI R20,0x00                    ; B=1.75f.
;            LDI R21,0x00
;            LDI R22,0xE0
;            LDI R23,0x3F

            ;
            ; Случай 4.         
;            LDI R16,0x00                    ; A=1.6875f.
;            LDI R17,0x00
;            LDI R18,0xD8
;            LDI R19,0x3F

;            LDI R20,0x00                    ; B=1.5f.
;            LDI R21,0x00
;            LDI R22,0xC0
;            LDI R23,0x3F

            ;
            ; Случай 5.         
;            LDI R16,0xFF                    ; A=1.99999988079071044921875f.
;            LDI R17,0xFF
;            LDI R18,0xFF
;            LDI R19,0x3F

;            LDI R20,0xFF                    ; B=A.
;            LDI R21,0xFF
;            LDI R22,0xFF
;            LDI R23,0x3F

            ;
            ; Случай 6.         
;            LDI R16,0xFF                    ; A=1.99999988079071044921875f.
;            LDI R17,0xFF
;            LDI R18,0xFF
;            LDI R19,0x3F

;            LDI R20,0x00                    ; B=1.0f.
;            LDI R21,0x00
;            LDI R22,0x80
;            LDI R23,0x3F

            ;
            ; Случай 7.
;            LDI R16,0x20                    ; A=1.688541412353515625f * 2^97.
;            LDI R17,0x22
;            LDI R18,0x58
;            LDI R19,0x70

;            LDI R20,0x00                    ; B=1.00885009765625f * 2^-95.
;            LDI R21,0x22
;            LDI R22,0x01
;            LDI R23,0x10

            ;
            ; Случай 8.
;            LDI R16,0x20                    ; A=1.688541412353515625f * 2^-116.
;            LDI R17,0x22
;            LDI R18,0xD8
;            LDI R19,0x05

;            LDI R20,0x00                    ; B=1.00885009765625f * 2^20.
;            LDI R21,0x22
;            LDI R22,0x81
;            LDI R23,0x49

            ;
            ; Случай 9.
;            LDI R16,0x00                    ; A=1.0f * 2^-96.
;            LDI R17,0x00
;            LDI R18,0x80
;            LDI R19,0x0F

;            LDI R20,0xFF                    ; B=F * 2^30.
;            LDI R21,0xFF
;            LDI R22,0xFF
;            LDI R23,0x4E

            ;
            ; Случай 10.
;            LDI R16,0x00                    ; A=1.0f * 2^20.
;            LDI R17,0x00
;            LDI R18,0x80
;            LDI R19,0x49

;            LDI R20,0xFF                    ; B=1.99999988079071044921875f * 2^-108.
;            LDI R21,0xFF
;            LDI R22,0xFF
;            LDI R23,0x09

            ;
            ; Случай 11.
;            LDI R16,0x20                    ; A=1.688541412353515625f * 2^3.
;            LDI R17,0x22
;            LDI R18,0x58
;            LDI R19,0x41

;            LDI R20,0x00                    ; B=1.00885009765625f * 2^106.
;            LDI R21,0x22
;            LDI R22,0x81
;            LDI R23,0x74

            ;
            ; Случай 12.
;            LDI R16,0x00                    ; A=1.0f * 2^3.
;            LDI R17,0x00
;            LDI R18,0x00
;            LDI R19,0x41

;            LDI R20,0xFF                    ; B=1.99999988079071044921875f * 2^106
;            LDI R21,0xFF
;            LDI R22,0xFF
;            LDI R23,0x74

            ;
            ; Случай 13.
;            LDI R16,0x00                    ; A=1.0f * 2^20.
;            LDI R17,0x00
;            LDI R18,0x80
;            LDI R19,0x49

;            LDI R20,0xFF                    ; B=1.99999988079071044921875f * 2^109.
;            LDI R21,0xFF
;            LDI R22,0x7F
;            LDI R23,0x09

            ;
            ; Случай 14.
;            LDI R16,0x00                    ; A=1.0f * 2^-115.
;            LDI R17,0x00
;            LDI R18,0x00
;            LDI R19,0x06

;            LDI R20,0xFF                    ; B=1.99999988079071044921875f * 2^12.
;            LDI R21,0xFF
;            LDI R22,0xFF
;            LDI R23,0x45

            ;
            ; Случай 15.
;            LDI R16,0xFF                    ; A=1.99999988079071044921875f * 2^-100.
;            LDI R17,0xFF
;            LDI R18,0xFF
;            LDI R19,0x0D

;            LDI R20,0x00                    ; B=1.0f * 2^27.
;            LDI R21,0x00
;            LDI R22,0x00
;            LDI R23,0x4D

            ;
            ; Оба операнда отрицательные.
            ; Результат положительный.
;            LDI R16,0x00                    ; A=-1.0f * 2^20.
;            LDI R17,0x00
;            LDI R18,0x80
;            LDI R19,0xC9

;            LDI R20,0xFF                    ; B=-1.99999988079071044921875f * 2^-108.
;            LDI R21,0xFF
;            LDI R22,0xFF
;            LDI R23,0x89

            ;
            ; Первый операнд отрицательный.
            ; Второй операнд положительный.
            ; Результат отрицательный.
;            LDI R16,0x00                    ; A=-1.0f * 2^20.
;            LDI R17,0x00
;            LDI R18,0x80
;            LDI R19,0xC9

;            LDI R20,0xFF                    ; B=1.99999988079071044921875f * 2^-108.
;            LDI R21,0xFF
;            LDI R22,0xFF
;            LDI R23,0x09

            ;
            ; Первый операнд положительный.
            ; Второй операнд отрицательный.
            ; Результат отрицательный.
;            LDI R16,0x00                    ; A=1.0f * 2^20.
;            LDI R17,0x00
;            LDI R18,0x80
;            LDI R19,0x49

;            LDI R20,0xFF                    ; B=-1.99999988079071044921875f * 2^-108.
;            LDI R21,0xFF
;            LDI R22,0xFF
;            LDI R23,0x89

            ;
            ; Делимое равно нулю.
            ; Результат нулевой.
;            LDI R16,0x00                    ; A=0.0f.
;            LDI R17,0x00
;            LDI R18,0x00
;            LDI R19,0x00

;            LDI R20,0xFF                    ; B=-1.99999988079071044921875f * 2^-108.
;            LDI R21,0xFF
;            LDI R22,0xFF
;            LDI R23,0x89

            ;
            ; Делитель равен нулю.
            ; Ошибка.
;            LDI R16,0x00                    ; A=1.0f * 2^20.
;            LDI R17,0x00
;            LDI R18,0x80
;            LDI R19,0x49

;            LDI R20,0x00                    ; B=0.0f.
;            LDI R21,0x00
;            LDI R22,0x00
;            LDI R23,0x00

            ;
            ; Оба операнда равны нулю.
            ; Ошибка.
;            LDI R16,0x00                    ; A=0.0f.
;            LDI R17,0x00
;            LDI R18,0x00
;            LDI R19,0x00

;            LDI R20,0x00                    ; B=0.0f.
;            LDI R21,0x00
;            LDI R22,0x00
;            LDI R23,0x00

            ;
            ; Доп. пример 1.
            ; Пример появился при тестировании реализации FTOA.
            ;
            ; NOTE: Доп. примеры не имеют эквивалентов в тестах на десктопе.
            ; Это единичные случаи, которые возникают и проверяются на месте.
;            LDI R16,0x02                    ; A=1.0000002384185791015625f.
;            LDI R17,0x00
;            LDI R18,0x80
;            LDI R19,0x3F

;            LDI R20,0x00                    ; B=10.0f.
;            LDI R21,0x00
;            LDI R22,0x20
;            LDI R23,0x41
;===========================================================================================
; End: Примеры на деление.
;===========================================================================================

;===========================================================================================
; Begin: примеры на умножение.
;===========================================================================================
            ;
            ; Случай 1.
;            LDI R16,0x00                    ; A=1.875f.
;            LDI R17,0x00
;            LDI R18,0xF0
;            LDI R19,0x3F

;            LDI R20,0x00                    ; B=1.5f.
;            LDI R21,0x00
;            LDI R22,0xC0
;            LDI R23,0x3F

            ;
            ; Случай 2.
;            LDI R16,0x00                    ; A=1.25f.
;            LDI R17,0x00
;            LDI R18,0xA0
;            LDI R19,0x3F

;            LDI R20,0xCE                    ; B=1.6000001430511474609375f.
;            LDI R21,0xCC
;            LDI R22,0xCC
;            LDI R23,0x3F

            ;
            ; Случай 3.
;            LDI R16,0x00                    ; A=1.5f.
;            LDI R17,0x00
;            LDI R18,0xC0
;            LDI R19,0x3F

;            LDI R20,0xAB                    ; B=1.33333337306976318359375f.
;            LDI R21,0xAA
;            LDI R22,0xAA
;            LDI R23,0x3F

            ;
            ; Случай 4.
;            LDI R16,0xFA                    ; A=1.9999992847442626953125f.
;            LDI R17,0xFF
;            LDI R18,0xFF
;            LDI R19,0x3F

;            LDI R20,0x00                    ; B=1.5f.
;            LDI R21,0x00
;            LDI R22,0xC0
;            LDI R23,0x3F

            ;
            ; Случай 5.
;            LDI R16,0xFE                    ; A=1.9999997615814208984375f.
;            LDI R17,0xFF
;            LDI R18,0xFF
;            LDI R19,0x3F

;            LDI R20,0x00                    ; B=1.5f.
;            LDI R21,0x00
;            LDI R22,0xC0
;            LDI R23,0x3F

            ;
            ; Случай 6.
;            LDI R16,0xFE                    ; A=1.9999997615814208984375f.
;            LDI R17,0xFF
;            LDI R18,0xFF
;            LDI R19,0x3F

;            LDI R20,0x01                    ; B=1.00000011920928955078125f.
;            LDI R21,0x00
;            LDI R22,0x80
;            LDI R23,0x3F

            ;
            ; Случай 7.
;            LDI R16,0xFE                    ; A=1.9999997615814208984375f * 2^100.
;            LDI R17,0xFF
;            LDI R18,0xFF
;            LDI R19,0x71

;            LDI R20,0x00                    ; B=1.5f * 2^27.
;            LDI R21,0x00
;            LDI R22,0x40
;            LDI R23,0x4D

            ;
            ; Случай 8.
;            LDI R16,0xFE                    ; A=1.9999997615814208984375f * 2^100.
;            LDI R17,0xFF
;            LDI R18,0xFF
;            LDI R19,0x71

;            LDI R20,0x00                    ; B=1.5f * 2^26.
;            LDI R21,0x00
;            LDI R22,0xC0
;            LDI R23,0x4C

            ;
            ; Случай 9.
;            LDI R16,0xFE                    ; A=1.9999997615814208984375f * 2^100.
;            LDI R17,0xFF
;            LDI R18,0xFF
;            LDI R19,0x71

;            LDI R20,0x00                    ; B=1.5f * 2^28.
;            LDI R21,0x00
;            LDI R22,0xC0
;            LDI R23,0x4D

            ;
            ; Случай 10.
;            LDI R16,0xFE                    ; A=1.9999997615814208984375f * 2^-100.
;            LDI R17,0xFF
;            LDI R18,0xFF
;            LDI R19,0x0D

;            LDI R20,0x00                    ; B=1.5f * 2^-27.
;            LDI R21,0x00
;            LDI R22,0x40
;            LDI R23,0x32

            ;
            ; Случай 11.
;            LDI R16,0xFE                    ; A=1.9999997615814208984375f * 2^-100.
;            LDI R17,0xFF
;            LDI R18,0xFF
;            LDI R19,0x0D

;            LDI R20,0x00                    ; B=1.5f * 2^-28.
;            LDI R21,0x00
;            LDI R22,0xC0
;            LDI R23,0x31

            ;
            ; Случай 12.
;            LDI R16,0x00                    ; A=1.25f * 2^100.
;            LDI R17,0x00
;            LDI R18,0xA0
;            LDI R19,0x71

;            LDI R20,0xAB                    ; B=1.33333337306976318359375f * 2^27.
;            LDI R21,0xAA
;            LDI R22,0x2A
;            LDI R23,0x4D

            ;
            ; Случай 13.
;            LDI R16,0xFE                    ; A=1.9999997615814208984375f * 2^100.
;            LDI R17,0xFF
;            LDI R18,0xFF
;            LDI R19,0x71

;            LDI R20,0x01                    ; B=1.00000011920928955078125f * 2^28.
;            LDI R21,0x00
;            LDI R22,0x80
;            LDI R23,0x4D

            ;
            ; Случай 14.
;            LDI R16,0x00                    ; A=1.25f * 2^-126.
;            LDI R17,0x00
;            LDI R18,0xA0
;            LDI R19,0x00

;            LDI R20,0xAB                    ; B=1.33333337306976318359375f * 2^-25.
;            LDI R21,0xAA
;            LDI R22,0x2A
;            LDI R23,0x33            

            ;
            ; Случай 15.
;            LDI R16,0xFE                    ; A=1.9999997615814208984375f * 2^100.
;            LDI R17,0xFF
;            LDI R18,0xFF
;            LDI R19,0x71

;            LDI R20,0x01                    ; B=1.00000011920928955078125f * 2^27.
;            LDI R21,0x00
;            LDI R22,0x00
;            LDI R23,0x4D

            ;
            ; Случай 16.
;            LDI R16,0xFE                    ; A=1.9999997615814208984375f * 2^100.
;            LDI R17,0xFF
;            LDI R18,0xFF
;            LDI R19,0x71

;            LDI R20,0x01                    ; B=1.00000011920928955078125f * 2^26.
;            LDI R21,0x00
;            LDI R22,0x80
;            LDI R23,0x4C

            ;
            ; Случай 17.
;            LDI R16,0xFE                    ; A=1.9999997615814208984375f * 2^-100.
;            LDI R17,0xFF
;            LDI R18,0xFF
;            LDI R19,0x0D

;            LDI R20,0x01                    ; B=1.00000011920928955078125f * 2^-27.
;            LDI R21,0x00
;            LDI R22,0x00
;            LDI R23,0x32

            ;
            ; Случай 18.
;            LDI R16,0xFE                    ; A=1.9999997615814208984375f * 2^-100.
;            LDI R17,0xFF
;            LDI R18,0xFF
;            LDI R19,0x0D

;            LDI R20,0x01                    ; B=1.00000011920928955078125f * 2^-30.
;            LDI R21,0x00
;            LDI R22,0x80
;            LDI R23,0x30

            ;
            ; Случай 19.
;            LDI R16,0xFF                    ; A=1.99999988079071044921875fF * 2^-126.
;            LDI R17,0xFF
;            LDI R18,0xFF
;            LDI R19,0x00

;            LDI R20,0x00                    ; B=1.0f * 2^-1.
;            LDI R21,0x00
;            LDI R22,0x00
;            LDI R23,0x3F

            ;
            ; Первый операнд нулевой.
            ; Результат нулевой.
;            LDI R16,0x00                    ; A=0.0f.
;            LDI R17,0x00
;            LDI R18,0x00
;            LDI R19,0x00

;            LDI R20,0x01                    ; B=1.00000011920928955078125f * 2^26.
;            LDI R21,0x00
;            LDI R22,0x80
;            LDI R23,0x4C

            ;
            ; Второй операнд нулевой.
            ; Результат нулевой.
;            LDI R16,0xFE                    ; A=1.9999997615814208984375f * 2^100.
;            LDI R17,0xFF
;            LDI R18,0xFF
;            LDI R19,0x71

;            LDI R20,0x00                    ; B=0.0f.
;            LDI R21,0x00
;            LDI R22,0x00
;            LDI R23,0x00

            ;
            ; Оба операнда отрицательные.
            ; Результат положительный.
;            LDI R16,0xFE                    ; A=-1.9999997615814208984375f * 2^100.
;            LDI R17,0xFF
;            LDI R18,0xFF
;            LDI R19,0xF1

;            LDI R20,0x01                    ; B=-1.00000011920928955078125f * 2^26.
;            LDI R21,0x00
;            LDI R22,0x80
;            LDI R23,0xCC

            ;
            ; Первый операнд отрицательный.
            ; Второй операнд положительный.
            ; Результат отрицательный.
;            LDI R16,0xFE                    ; A=-1.9999997615814208984375f * 2^100.
;            LDI R17,0xFF
;            LDI R18,0xFF
;            LDI R19,0xF1

;            LDI R20,0x01                    ; B=1.00000011920928955078125f * 2^26.
;            LDI R21,0x00
;            LDI R22,0x80
;            LDI R23,0x4C

            ;
            ; Первый операнд положительный.
            ; Второй операнд отрицательный.
            ; Результат отрицательный.
;            LDI R16,0xFE                    ; A=1.9999997615814208984375f * 2^100.
;            LDI R17,0xFF
;            LDI R18,0xFF
;            LDI R19,0x71

;            LDI R20,0x01                    ; B=-1.00000011920928955078125f * 2^26.
;            LDI R21,0x00
;            LDI R22,0x80
;            LDI R23,0xCC

            ;
            ; Пример 20.
            ; Bugfix: переполнение в ветке округления.
;            LDI R16,0xF9                    ; A=10^10.
;            LDI R17,0x02
;            LDI R18,0x15
;            LDI R19,0x50

;            LDI R20,0x00                    ; B=10.
;            LDI R21,0x00
;            LDI R22,0x20
;            LDI R23,0x41
;===========================================================================================
; End: примеры на умножение.
;===========================================================================================

;===========================================================================================
; Begin: примеры для FADD32.
;===========================================================================================
            ;
            ; Случай 1.
;            LDI R16,0xFF                    ; A=1.99999988079071044921875f * 2^127.
;            LDI R17,0xFF
;            LDI R18,0x7F
;            LDI R19,0x7F

;            LDI R20,0xFF                    ; B=A.
;            LDI R21,0xFF
;            LDI R22,0x7F
;            LDI R23,0x7F

            ;
            ; Случай 2.
;            LDI R16,0xFF                    ; A=1.99999988079071044921875f * 2^-126.
;            LDI R17,0xFF
;            LDI R18,0xFF
;            LDI R19,0x00

;            LDI R20,0xFF                    ; B=A.
;            LDI R21,0xFF
;            LDI R22,0xFF
;            LDI R23,0x00

            ;
            ; Случай 3.
;            LDI R16,0x00                    ; A=1.0f * 2^127.
;            LDI R17,0x00
;            LDI R18,0x00
;            LDI R19,0x7F

;            LDI R20,0x03                    ; B=1.00000035762786865234375f * 2^127.
;            LDI R21,0x00
;            LDI R22,0x00
;            LDI R23,0x7F

            ;
            ; Случай 4.
;            LDI R16,0x00                    ; A=1.0f * 2^-126.
;            LDI R17,0x00
;            LDI R18,0x80
;            LDI R19,0x00

;            LDI R20,0x03                    ; B=1.00000035762786865234375f * 2^-126.
;            LDI R21,0x00
;            LDI R22,0x80
;            LDI R23,0x00

            ;
            ; Случай 5.
;            LDI R16,0x00                    ; A=1.0f * 2^127.
;            LDI R17,0x00
;            LDI R18,0x00
;            LDI R19,0x7F

;            LDI R20,0x01                    ; B=1.00000011920928955078125f * 2^127.
;            LDI R21,0x00
;            LDI R22,0x00
;            LDI R23,0x7F

            ;
            ; Случай 6.
;            LDI R16,0x00                    ; A=1.0f * 2^-126.
;            LDI R17,0x00
;            LDI R18,0x80
;            LDI R19,0x00

;            LDI R20,0x01                    ; B=1.00000011920928955078125f * 2^-126.
;            LDI R21,0x00
;            LDI R22,0x80
;            LDI R23,0x00

            ;
            ; Случай 7.
;            LDI R16,0x00                    ; A=1.0f * 2^127.
;            LDI R17,0x00
;            LDI R18,0x00
;            LDI R19,0x7F

;            LDI R20,0xFE                    ; B=1.9999997615814208984375f * 2^127.
;            LDI R21,0xFF
;            LDI R22,0x7F
;            LDI R23,0x7F

            ;
            ; Случай 8.
;            LDI R16,0x00                    ; A=1.0f * 2^-126.
;            LDI R17,0x00
;            LDI R18,0x80
;            LDI R19,0x00

;            LDI R20,0xFE                    ; B=1.9999997615814208984375f * 2^-126.
;            LDI R21,0xFF
;            LDI R22,0xFF
;            LDI R23,0x00

            ;
            ; Случай 9.
;            LDI R16,0xFF                    ; A=1.99999988079071044921875f * 2^127.
;            LDI R17,0xFF
;            LDI R18,0x7F
;            LDI R19,0x7F

;            LDI R20,0xE9                    ; B=1.99993622303009033203125f * 2^118.
;            LDI R21,0xFD
;            LDI R22,0xFF
;            LDI R23,0x7A

            ;
            ; Случай 10.
;            LDI R16,0xFF                    ; A=1.99999988079071044921875f * 2^-117.
;            LDI R17,0xFF
;            LDI R18,0x7F
;            LDI R19,0x05

;            LDI R20,0xE9                    ; B=1.99993622303009033203125f * 2^-126.
;            LDI R21,0xFD
;            LDI R22,0xFF
;            LDI R23,0x00

            ;
            ; Случай 11.
;            LDI R16,0xFF                    ; A=1.99999988079071044921875f * 2^127.
;            LDI R17,0xFF
;            LDI R18,0x7F
;            LDI R19,0x7F

;            LDI R20,0xE9                    ; B=1.99999725818634033203125f * 2^118.
;            LDI R21,0xFF
;            LDI R22,0xFF
;            LDI R23,0x7A

            ;
            ; Случай 12.
;            LDI R16,0xFF                    ; A=1.99999988079071044921875f * 2^-117.
;            LDI R17,0xFF
;            LDI R18,0x7F
;            LDI R19,0x05

;            LDI R20,0xED                    ; B=1.99999773502349853515625f * 2^-126.
;            LDI R21,0xFF
;            LDI R22,0xFF
;            LDI R23,0x00

            ;
            ; Случай 14.
;            LDI R16,0x00                    ; A=1.99609375f * 2^126.
;            LDI R17,0x80
;            LDI R18,0xFF
;            LDI R19,0x7E

;            LDI R20,0xE9                    ; B=1.99999725818634033203125f * 2^117.
;            LDI R21,0xFF
;            LDI R22,0x7F
;            LDI R23,0x7A

            ;
            ; Случай 15.
;            LDI R16,0x00                    ; A=1.99609375f * 2^127.
;            LDI R17,0x80
;            LDI R18,0x7F
;            LDI R19,0x7F

;            LDI R20,0xE9                    ; B=1.99993622303009033203125f * 2^118.
;            LDI R21,0xFD
;            LDI R22,0xFF
;            LDI R23,0x7A

            ;
            ; Случай 16.
;            LDI R16,0x00                    ; A=1.99609375f * 2^127.
;            LDI R17,0x80
;            LDI R18,0x7F
;            LDI R19,0x7F

;            LDI R20,0xEB                    ; B=1.99996697902679443359375f * 2^118.
;            LDI R21,0xFE
;            LDI R22,0xFF
;            LDI R23,0x7A

            ;
            ; Случай 26.
;            LDI R16,0x00                    ; A=1.99609375f * 2^100.
;            LDI R17,0x80
;            LDI R18,0xFF
;            LDI R19,0x71

;            LDI R20,0x00                    ; B=1.999969482421875f * 2^92.
;            LDI R21,0xFF
;            LDI R22,0xFF
;            LDI R23,0x6D

            ;
            ; Случай 36.
;            LDI R16,0x00                    ; A=1.9921875f * 2^100.
;            LDI R17,0x00
;            LDI R18,0xFF
;            LDI R19,0x71

;            LDI R20,0x80                    ; B=1.9999847412109375f * 2^92.
;            LDI R21,0xFF
;            LDI R22,0xFF
;            LDI R23,0x6D

            ;
            ; Случай 40.
;            LDI R16,0xFF                    ; A=1.99999988079071044921875f * 2^127.
;            LDI R17,0xFF
;            LDI R18,0x7F
;            LDI R19,0x7F

;            LDI R20,0xFF                    ; B=1.99999988079071044921875f * 2^96.
;            LDI R21,0xFF
;            LDI R22,0xFF
;            LDI R23,0x6F

            ;
            ; Случай 41.
;            LDI R16,0xFF                    ; A=1.99999988079071044921875f * 2^127.
;            LDI R17,0xFF
;            LDI R18,0x7F
;            LDI R19,0x7F

;            LDI R20,0xFF                    ; B=1.99999988079071044921875f * 2^-126.
;            LDI R21,0xFF
;            LDI R22,0xFF
;            LDI R23,0x00

            ;
            ; Случай 42.
;            LDI R16,0xBF                    ; A=-1.01158893108367919921875f.
;            LDI R17,0x7B
;            LDI R18,0x81
;            LDI R19,0xBF

;            LDI R20,0xFF                    ; B=-0.00006100535028963349759578704833984375f.
;            LDI R21,0xDF
;            LDI R22,0x7F
;            LDI R23,0xB8
;===========================================================================================
; End: примеры для FADD32.
;===========================================================================================

;===========================================================================================
; Begin: примеры для FADD32. Второй операнд отрицательный.
;===========================================================================================
            ;
            ; Случай 0.
;            LDI R16,0xFF                    ; A=1.99999988079071044921875f.
;            LDI R17,0xFF
;            LDI R18,0xFF
;            LDI R19,0x3F

;            LDI R20,0xFF                    ; B=-1.99999988079071044921875f.
;            LDI R21,0xFF
;            LDI R22,0xFF
;            LDI R23,0xBF
            
            ;
            ; Случай 1.
;            LDI R16,0x01                    ; A=1.00000011920928955078125f * 2^-126.
;            LDI R17,0x00
;            LDI R18,0x80
;            LDI R19,0x00

;            LDI R20,0x00                    ; B=-1.0f * 2^-126.
;            LDI R21,0x00
;            LDI R22,0x80
;            LDI R23,0x80

            ;
            ; Случай 2.
;            LDI R16,0xFF                    ; A=1.99999988079071044921875f * 2^-125.
;            LDI R17,0xFF
;            LDI R18,0x7F
;            LDI R19,0x01

;            LDI R20,0x00                    ; B=-1.0f * 2^-125.
;            LDI R21,0x00
;            LDI R22,0x00
;            LDI R23,0x81

            ;
            ; Случай 4.
;            LDI R16,0x00                    ; A=1.0f * 2^-102.
;            LDI R17,0x00
;            LDI R18,0x80
;            LDI R19,0x0C

;            LDI R20,0xFF                    ; B=-1.99999988079071044921875f * 2^-103.
;            LDI R21,0xFF
;            LDI R22,0x7F
;            LDI R23,0x8C

            ;
            ; Случай 5.
;            LDI R16,0x02                    ; A=1.5000002384185791015625f.
;            LDI R17,0x00
;            LDI R18,0xC0
;            LDI R19,0x3F

;            LDI R20,0x01                    ; B=-1.00000011920928955078125f * 2^-1.
;            LDI R21,0x00
;            LDI R22,0x00
;            LDI R23,0xBF

            ;
            ; Случай 6.
;            LDI R16,0x01                    ; A=1.50000011920928955078125f.
;            LDI R17,0x00
;            LDI R18,0xC0
;            LDI R19,0x3F

;            LDI R20,0x01                    ; B=-1.00000011920928955078125f * 2^-1.
;            LDI R21,0x00
;            LDI R22,0x00
;            LDI R23,0xBF

            ;
            ; Случай 8.
;            LDI R16,0x00                    ; A=1.0f * 2^127.
;            LDI R17,0x00
;            LDI R18,0x00
;            LDI R19,0x7F

;            LDI R20,0x01                    ; B=-1.93750011920928955078125f * 2^101.
;            LDI R21,0x00
;            LDI R22,0x78
;            LDI R23,0xF2

            ;
            ; Случай 10.
;            LDI R16,0x00                    ; A=1.0f * 2^-102.
;            LDI R17,0x00
;            LDI R18,0x80
;            LDI R19,0x0C

;            LDI R20,0x01                    ; B=-1.48437511920928955078125f * 2^-126.
;            LDI R21,0x00
;            LDI R22,0xBE
;            LDI R23,0x80

            ;
            ; Случай 12.
;            LDI R16,0x00                    ; A=1.0f * 2^-101.
;            LDI R17,0x00
;            LDI R18,0x00
;            LDI R19,0x0D

;            LDI R20,0x01                    ; B=-1.48437511920928955078125f * 2^-126.
;            LDI R21,0x00
;            LDI R22,0xBE
;            LDI R23,0x80

            ;
            ; Случай 20.
;            LDI R16,0x00                    ; A=1.0f.
;            LDI R17,0x00
;            LDI R18,0x80
;            LDI R19,0x3F

;            LDI R20,0x00                    ; B=-1.0f * 2^-25.
;            LDI R21,0x00
;            LDI R22,0x00
;            LDI R23,0xB3

            ;
            ; Случай 33.
;            LDI R16,0x00                    ; A=1.5f.
;            LDI R17,0x00
;            LDI R18,0xC0
;            LDI R19,0x3F

;            LDI R20,0x00                    ; B=-1.0f * 2^-31.
;            LDI R21,0x00
;            LDI R22,0x00
;            LDI R23,0xB0

            ;
            ; Случай 34.
;            LDI R16,0x00                    ; A=1.0f.
;            LDI R17,0x00
;            LDI R18,0x80
;            LDI R19,0x3F

;            LDI R20,0x00                    ; B=-1.0f * 2^-32.
;            LDI R21,0x00
;            LDI R22,0x80
;            LDI R23,0xAF

            ;
            ; Случай 36.
;            LDI R16,0x00                    ; A=-10.0f.
;            LDI R17,0x00
;            LDI R18,0x20
;            LDI R19,0xC1

;            LDI R20,0x00                    ; B=5.0f.
;            LDI R21,0x00
;            LDI R22,0xA0
;            LDI R23,0x40

            ;
            ; |A| < |B| => своп.
;            LDI R16,0xFF                    ; A=1.99999988079071044921875f * 2^5.
;            LDI R17,0xFF
;            LDI R18,0x7F
;            LDI R19,0x42

;            LDI R20,0x00                    ; B=-1.5f * 2^10.
;            LDI R21,0x00
;            LDI R22,0xC0
;            LDI R23,0xC4

            ;
            ; Оба операнда равны нулю.
            ; Результат - ноль.
;            LDI R16,0x00                    ; A=0.0f.
;            LDI R17,0x00
;            LDI R18,0x00
;            LDI R19,0x00

;            LDI R20,0x00                    ; B=0.0f.
;            LDI R21,0x00
;            LDI R22,0x00
;            LDI R23,0x00

            ;
            ; Только первый операнд равен нулю.
            ; Результат - второй операнд.
;            LDI R16,0x00                    ; A=0.0f.
;            LDI R17,0x00
;            LDI R18,0x00
;            LDI R19,0x00

;            LDI R20,0xFF                    ; B=-1.99999988079071044921875f.
;            LDI R21,0xFF
;            LDI R22,0xFF
;            LDI R23,0xBF

            ;
            ; Только второй операнд равен нулю.
            ; Результат - первый операнд.
;            LDI R16,0xFF                    ; A=1.99999988079071044921875f.
;            LDI R17,0xFF
;            LDI R18,0xFF
;            LDI R19,0x3F

;            LDI R20,0x00                    ; B=0.0f.
;            LDI R21,0x00
;            LDI R22,0x00
;            LDI R23,0x00
;===========================================================================================
; End: примеры для FADD32. Второй операнд отрицательный.
;===========================================================================================

;===========================================================================================
; Begin: примеры для FSUB32.
;===========================================================================================
            ;
            ; Случай 1. Оба операнда отрицательные.
            ; NOTE: Пример добавлен поскольку обнаружилась проблема при вычислениях.
;            LDI R16,0x00                    ; A=-12.0f.
;            LDI R17,0x00
;            LDI R18,0x40
;            LDI R19,0xC1

;            LDI R20,0x00                    ; B=-14.0f.
;            LDI R21,0x00
;            LDI R22,0x60
;            LDI R23,0xC1

            ;
            ; Случай 2. Первый операнд отрицательный, второй - положительный.
            ; NOTE: Пример добавлен поскольку обнаружилась проблема при вычислениях.
;            LDI R16,0x00                    ; A=-12.0f.
;            LDI R17,0x00
;            LDI R18,0x40
;            LDI R19,0xC1

;            LDI R20,0x00                    ; B=14.0f.
;            LDI R21,0x00
;            LDI R22,0x60
;            LDI R23,0x41
;===========================================================================================
; End: примеры для FSUB32.
;===========================================================================================

;===========================================================================================
; Begin: проверка арифметики.
;===========================================================================================
;            STD Y+1,R16                     ; Записываем входные операнды в память.
;            STD Y+2,R17                     ; В тестовом коде в этом нет необходимости, т.к. далее
;            STD Y+3,R18                     ; Мы сразу же читаем из памяти и передаем операнды в подпрограмму.
;            STD Y+4,R19                     ; Делается это исключительно для полноты примера использования подпрограмм.

;            STD Y+5,R20
;            STD Y+6,R21
;            STD Y+7,R22
;            STD Y+8,R23

;            LDD R8,Y+1                      ; Передаем A и B в подпрограмму.
;            LDD R9,Y+2
;            LDD R10,Y+3
;            LDD R11,Y+4

;            LDD R12,Y+5
;            LDD R13,Y+6
;            LDD R14,Y+7
;            LDD R15,Y+8

;            CALL FDIV32
;            CALL FMUL32
;            CALL FADD32
;            CALL FSUB32

;            STD Y+9,R8                      ; Записываем результат в память.
;            STD Y+10,R9
;            STD Y+11,R10
;            STD Y+12,R11
;===========================================================================================
; End: проверка арифметики.
;===========================================================================================

;===========================================================================================
; Begin: примеры для FTOI.
;===========================================================================================
            ;
            ; Пример 1.
;            LDI R16,0x00                    ; A=1.0f.
;            LDI R17,0x00
;            LDI R18,0x80
;            LDI R19,0x3F

            ;
            ; Пример 2.
;            LDI R16,0xFF                    ; A=9.99999904632568359375f.
;            LDI R17,0xFF
;            LDI R18,0x1F
;            LDI R19,0x41
;===========================================================================================
; End: примеры для FTOI.
;===========================================================================================

;===========================================================================================
; Begin: проверка FTOI.
;===========================================================================================
;            STD Y+1,R16
;            STD Y+2,R17
;            STD Y+3,R18
;            STD Y+4,R19

;            LDD R8,Y+1                      ; Передаем число - NUM.
;            LDD R9,Y+2
;            LDD R10,Y+3
;            LDD R11,Y+4

;            CALL FTOI
;===========================================================================================
; End: проверка FTOI.
;===========================================================================================

;===========================================================================================
; Begin: примеры для ITOF.
;===========================================================================================
            ;
            ; Пример 1.
;            LDI R16,1
;            MOV R8,R16

            ;
            ; Пример 2.
;            LDI R16,9
;            MOV R8,R16

            ;
            ; Пример 3.
;            LDI R16,23
;            MOV R8,R16

            ;
            ; Пример 4.
;            LDI R16,137
;            MOV R8,R16

            ;
            ; Пример 5.
;            LDI R16,255
;            MOV R8,R16

            ;
            ; Пример 6.
;            LDI R16,0
;            MOV R8,R16
;===========================================================================================
; End: примеры для ITOF.
;===========================================================================================

;===========================================================================================
; Begin: проверка ITOF.
;===========================================================================================
;            CALL ITOF
;===========================================================================================
; End: проверка ITOF.
;===========================================================================================

;===========================================================================================
; Begin: примеры для FTOAN.
;===========================================================================================
            ;
            ; Пример 1.
;            LDI R16,0x00                    ; A=0.0f.
;            LDI R17,0x00
;            LDI R18,0x00
;            LDI R19,0x00

            ;
            ; Пример 2.
;            LDI R16,0x00                    ; A=1.0f.
;            LDI R17,0x00
;            LDI R18,0x80
;            LDI R19,0x3F

            ;
            ; Пример 3.
;            LDI R16,0xFF                    ; A=9.99999904632568359375f.
;            LDI R17,0xFF
;            LDI R18,0x1F
;            LDI R19,0x41

            ;
            ; Пример 4.
;            LDI R16,0xC4                    ; A=-4.5832233428955078125f.
;            LDI R17,0xA9
;            LDI R18,0x92
;            LDI R19,0xC0
            
;            LDI R20,23                      ; Точность - PRECISION.
;            MOV R12,R20                     ;
;===========================================================================================
; END: ПРИМЕРЫ ДЛЯ FTOAN.
;===========================================================================================

;===========================================================================================
; Begin: проверка FTOAN.
;===========================================================================================
;            STD Y+1,R16
;            STD Y+2,R17
;            STD Y+3,R18
;            STD Y+4,R19

;            LDD R8,Y+1                      ; Передаем число - NUM.
;            LDD R9,Y+2
;            LDD R10,Y+3
;            LDD R11,Y+4

;            LDI XL,LOW(NUMSTR)              ; Передаем указатель на строку - NUMSTR.
;            LDI XH,HIGH(NUMSTR)

;            CALL FTOAN
;===========================================================================================
; End: проверка FTOAN.
;===========================================================================================

;===========================================================================================
; Begin: проверка ATOF.
;===========================================================================================
;            LDI XL,LOW(NUMSTR)              ; Передаем указатель на числовую строку.
;            LDI XH,HIGH(NUMSTR)

;            CALL ATOF

;            STD Y+9,R8                      ; Записываем результат в память.
;            STD Y+10,R9
;            STD Y+11,R10
;            STD Y+12,R11
;===========================================================================================
; End: проверка ATOF.
;===========================================================================================

;===========================================================================================
; Begin: примеры для FTOAE.
;===========================================================================================
            ;
            ; Пример 1.
            LDI R16,0xFF                    ; A=340282346638528859811704183484516925440.0f.
            LDI R17,0xFF
            LDI R18,0x7F
            LDI R19,0x7F

            ;
            ; Пример 2.
;            LDI R16,0x00                    ; A=-10.0f.
;            LDI R17,0x00
;            LDI R18,0x20
;            LDI R19,0xC1

            ;
            ; Пример 3.
;            LDI R16,0xFF                    ; A=9.99999904632568359375.0f.
;            LDI R17,0xFF
;            LDI R18,0x1F
;            LDI R19,0x41

            ;
            ; Пример 4.
;            LDI R16,0x00                    ; A=-1.0f.
;            LDI R17,0x00
;            LDI R18,0x80
;            LDI R19,0xBF

            ;
            ; Пример 5.
;            LDI R16,0xFF                    ; A=0.999999940395355224609375f.
;            LDI R17,0xFF
;            LDI R18,0x7F
;            LDI R19,0x3F

            ;
            ; Пример 6.
;            LDI R16,0x00                    ; A=-2^-126.
;            LDI R17,0x00
;            LDI R18,0x80
;            LDI R19,0x80

            ;
            ; Пример 7.
;            LDI R16,0xC2                    ; A=10^37 (это значение до отображения в float32).
;            LDI R17,0xBD
;            LDI R18,0xF0
;            LDI R19,0x7C

            ;
            ; Пример 8.
;            LDI R16,0x19                    ; A=10^33 (это значение до отображения в float32).
;            LDI R17,0x37
;            LDI R18,0x45
;            LDI R19,0x76

            ;
            ; Пример 9.
;            LDI R16,0x27                    ; A=25307.576171875f.
;            LDI R17,0xB7
;            LDI R18,0xC5
;            LDI R19,0x46

            ;
            ; Пример 10.
;            LDI R16,0xF2                    ; A=1.3023970127105712890625f * 2^-34.
;            LDI R17,0xB4
;            LDI R18,0xA6
;            LDI R19,0x2E

            ;
            ; Пример 11.
;            LDI R16,0x00                    ; A=0.0f.
;            LDI R17,0x00
;            LDI R18,0x00
;            LDI R19,0x00
            
            LDI R20,16                      ; MAXLEN.
            MOV R12,R20
;===========================================================================================
; End: примеры для FTOAE.
;===========================================================================================

;===========================================================================================
; Begin: проверка FTOAE.
;===========================================================================================
            STD Y+1,R16
            STD Y+2,R17
            STD Y+3,R18
            STD Y+4,R19

            LDD R8,Y+1                      ; Передаем число - NUM.
            LDD R9,Y+2
            LDD R10,Y+3
            LDD R11,Y+4

            LDI XL,LOW(NUMSTR)              ; Передаем указатель на строку - NUMSTR.
            LDI XH,HIGH(NUMSTR)

            CALL FTOAE
;===========================================================================================
; End: проверка FTOAE.
;===========================================================================================

END:        RJMP END

            ;
            ; Обработчик ошибок, возникающих при вычислениях с плавающей точкой:
            ; - Деление на ноль.
            ; - Переполнение.
FLOATERR:   RJMP END

;===========================================================================================
; Begin: примеры для ATOF.
;===========================================================================================
            ; Пример 0.
;NUMPRG:     .DB "0.000000000000000000000000000000000000009",0

            ; Пример 1.
;NUMPRG:     .DB "0.00000000000000000000000000000000000001",0

            ; Пример 2.
;NUMPRG:     .DB "0.00000000000000000000000000000000000002",0

            ; Пример 3.
;NUMPRG:     .DB "0.340282429999999999999999999999999999999",0

            ; Пример 4.
;NUMPRG:     .DB "3.40282429999999999999999999999999999999",0

            ; Пример 5.
;NUMPRG:     .DB "340282429999999999.999999999999999999999",0

            ; Пример 6.
;NUMPRG:     .DB "340282429999999999999999999999999999999",0

            ; Пример 7.
;NUMPRG:     .DB "340282429999999999999999999999999999999.0",0

            ; Пример 8.
;NUMPRG:     .DB "0.340282430000000000000000000000000000000",0

            ; Пример 9.
;NUMPRG:     .DB "3.40282430000000000000000000000000000000",0

            ; Пример 10.
;NUMPRG:     .DB "3402824300000000.00000000000000000000000",0

            ; Пример 11.
;NUMPRG:     .DB "340282430000000000000000000000000000000",0

            ; Пример 12.
;NUMPRG:     .DB "11111111111111111.11111111111111111111119999",0

            ; Пример 13.
;NUMPRG:     .DB "297270070.293992768437644036421190501130",0

            ; Пример 14.
;NUMPRG:     .DB "406.93306",0

            ; Пример 15.
;NUMPRG:     .DB "70856.4138686531",0

            ; Пример 16.
;NUMPRG:     .DB "0",0

            ; Пример 17.
;NUMPRG:     .DB "0.00",0

            ; Пример 18.
;NUMPRG:     .DB "-16.123",0

            ; Пример 19.
;NUMPRG:     .DB "-0.0",0

            ;
            ; Пример 1 на обработку исключений.
            ; Даст переполнение в FMUL32. На обработке целой части. На масштабировании NUM.
;NUMPRG:     .DB "3402824299999999999999999999999999999990",0

            ;
            ; Пример 2 на обработку исключений.
            ; Даст переполнение в FMUL32. На обработке дробной части. На масштабировании NUM.
;NUMPRG:     .DB "340282429999999999999999999999999999999.0",0

            ;
            ; Пример 3 на обработку исключений.
            ; Даст переполнение в FMUL32. На обработке дробной части. На формировании OVERSCALE.
;NUMPRG:     .DB "0.340282429999999999999999999999999999999",0
;===========================================================================================
; End: примеры для ATOF.
;===========================================================================================
